```
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:   ~ update in-place
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: 
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: Terraform will perform the following actions:
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: 
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:   # module.ocp_base.ibm_container_addons.addons will be updated in-place
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:   ~ resource "ibm_container_addons" "addons" {
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:         id                = "cugph50l0khjea3kdhp0"
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:         # (4 unchanged attributes hidden)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: 
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:       - addons {
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - allowed_upgrade_versions = [
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:               - "1.2.2",
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:               - "1.2.3",
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:             ] -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - deprecated               = false -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - health_state             = "normal" -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - health_status            = "Addon Ready. For more info: http://ibm.biz/addon-state (H1500)" -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - name                     = "cluster-autoscaler" -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - target_version           = "1.2.2" -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - version                  = "1.2.1" -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           - vlan_spanning_required   = false -> null
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:             # (5 unchanged attributes hidden)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:         }
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:       + addons {
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + allowed_upgrade_versions = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + deprecated               = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + health_state             = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + health_status            = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + min_kube_version         = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + min_ocp_version          = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + name                     = "cluster-autoscaler"
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + options                  = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + supported_kube_range     = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + target_version           = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + version                  = "1.2.3"
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:           + vlan_spanning_required   = (known after apply)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:             # (1 unchanged attribute hidden)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:         }
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: 
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:         # (2 unchanged blocks hidden)
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185:     }
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: 
TestRunUpgradeAdvancedExample 2025-02-04T06:03:10Z command.go:185: Plan: 0 to add, 1 to change, 0 to destroy.

```

The change is an update in place of the cluster autoscaler.
